import type { Translation } from "../i18n-types";
import type { DeepPartial } from "../DeepPartial";

const actionbar: DeepPartial<Translation["actionbar"]> = {
    understand: "فهمت!",
    edit: "تحرير",
    cancel: "إلغاء",
    close: "إغلاق",
    login: "تسجيل الدخول",
    map: "خريطة",
    profil: "تحرير اسمك",
    startScreenSharing: "بدء مشاركة الشاشة",
    stopScreenSharing: "إيقاف مشاركة الشاشة",
    screenSharingMode: "وضع مشاركة الشاشة",
    calendar: "التقويم",
    todoList: "قائمة المهام",
    woka: "تخصيص صورتك الرمزية",
    companion: "إضافة رفيق",
    test: "اختبر إعداداتي",
    editCamMic: "تحرير الكاميرا / الميكروفون",
    allSettings: "جميع الإعدادات",
    globalMessage: "إرسال رسالة عالمية",
    mapEditor: "محرر الخرائط",
    mapEditorMobileLocked: "محرر الخرائط مقفل في الوضع المحمول",
    mapEditorLocked: "محرر الخرائط مغلق 🔐",
    app: "التطبيقات الخارجية",
    camera: {
        disabled: "الكاميرا معطلة",
        activate: "قم بتنشيط الكاميرا",
        noDevices: "لم يتم العثور على جهاز كاميرا",
    },
    microphone: {
        disabled: "الميكروفون معطل",
        activate: "قم بتنشيط الميكروفون",
        noDevices: "لم يتم العثور على جهاز ميكروفون",
    },
    speaker: {
        disabled: "مكبر الصوت معطل",
        activate: "قم بتنشيط مكبر الصوت",
        noDevices: "لم يتم العثور على جهاز مكبر صوت",
    },
    status: {
        ONLINE: "متصل",
        AWAY: "بعيد",
        BACK_IN_A_MOMENT: "سأعود بعد قليل",
        DO_NOT_DISTURB: "عدم الإزعاج",
        BUSY: "مشغول",
        OFFLINE: "غير متصل",
        SILENT: "صامت",
        JITSI: "في اجتماع",
        BBB: "في اجتماع",
        DENY_PROXIMITY_MEETING: "غير متوفر",
        SPEAKER: "في اجتماع",
        LIVEKIT: "في اجتماع",
    },
    subtitle: {
        camera: "الكاميرا",
        microphone: "الميكروفون",
        speaker: "مكبر الصوت",
    },
    help: {
        chat: {
            title: "إرسال رسالة نصية",
            desc: "شارك أفكارك أو ابدأ مناقشة مباشرة كتابةً. بسيط، واضح، فعال.",
        },
        users: {
            title: "عرض قائمة المستخدمين",
            desc: "شاهد من هناك، قم بالوصول إلى بطاقة أعمالهم، أرسل لهم رسالة، أو اقترب منهم بنقرة واحدة!",
        },
        emoji: {
            title: "عرض رمز تعبيري",
            desc: "عبّر عن شعورك بنقرة واحدة باستخدام ردود الفعل الرمزية. فقط اضغط وانطلق!",
        },
        audioManager: {
            title: "حجم الأصوات المحيطة",
            desc: "قم بضبط حجم الأصوات المحيطة بسهولة.",
            pause: "انقر هنا لإيقاف الصوت مؤقتاً",
            play: "انقر هنا لتشغيل الصوت",
            stop: "انقر هنا لإيقاف الصوت",
        },
        audioManagerNotAllowed: {
            title: "الأصوات المحيطة محظورة",
            desc: "منع متصفحك تشغيل الأصوات المحيطة. انقر على الرمز لبدء تشغيل الأصوات.",
        },
        follow: {
            title: "طلب المتابعة",
            desc: "يمكنك طلب متابعة مستخدم، وإذا تم قبول هذا الطلب، سيتبعك ووكاه تلقائيًا، مما يضمن اتصالًا سلسًا.",
        },
        unfollow: {
            title: "إيقاف المتابعة",
            desc: "يمكنك اختيار إيقاف متابعة مستخدم في أي وقت. سيتوقف ووكاه عن متابعته، مما يمنحك حرية الحركة.",
        },
        lock: {
            title: "قفل المحادثة",
            desc: "بتفعيل هذه الميزة، تضمن عدم انضمام أي شخص إلى المناقشة. أنت سيد مساحتك، ويمكن فقط لأولئك الموجودين بالفعل التفاعل.",
        },
        mic: {
            title: "تمكين/تعطيل الميكروفون",
            desc: "قم بتشغيل أو إيقاف الميكروفون بسهولة.",
        },
        micDisabledByStatus: {
            title: "الميكروفون معطل",
            desc: 'الميكروفون معطل لأن حالتك هي "{status}".',
        },
        cam: {
            title: "تمكين/تعطيل الكاميرا",
            desc: "قم بتشغيل أو إيقاف الكاميرا بسهولة.",
        },
        camDisabledByStatus: {
            title: "الكاميرا معطلة",
            desc: 'الكاميرا معطلة لأن حالتك هي "{status}".',
        },
        share: {
            title: "مشاركة الشاشة",
            desc: "هل تريد مشاركة شاشتك مع مستخدمين آخرين؟ يمكنك ذلك! يمكنك عرض شاشتك للجميع في الدردشة، ويمكنك اختيار مشاركة الشاشة بالكامل أو نافذة معينة فقط.",
        },
        apps: {
            title: "التطبيقات الخارجية",
            desc: "لديك الحرية في التنقل بين التطبيقات الخارجية أثناء البقاء في تطبيقنا، لتجربة سلسة وغنية.",
        },
        roomList: {
            title: "قائمة الغرف",
            desc: "عرض قائمة الغرف المتاحة.",
        },
        calendar: {
            title: "التقويم",
            desc: "عرض التقويم الخاص بك.",
        },
        todolist: {
            title: "قائمة المهام",
            desc: "إدارة قائمة المهام الخاصة بك بسهولة.",
        },
        pictureInPicture: {
            title: "صورة داخل صورة",
            descDisabled:
                "للأسف، هذه الميزة غير متوفرة على جهازك ❌. يرجى تجربة استخدام جهاز أو متصفح آخر، مثل Chrome أو Edge، للوصول إلى هذه الميزة.",
            desc: "يمكنك استخدام ميزة صورة داخل صورة لمشاهدة فيديو أو عرض تقديمي أثناء وجودك في محادثة. ما عليك سوى النقر على أيقونة صورة داخل صورة والاستمتاع بمحتواك.",
        },
    },
    listStatusTitle: {
        enable: "تغيير حالتك",
    },
    externalModule: {
        status: {
            onLine: "الحالة على ما يرام ✅",
            offLine: "الحالة غير متصلة ❌",
            warning: "الحالة تحذير ⚠️",
            sync: "الحالة متزامنة 🔄",
        },
    },
    featureNotAvailable: "الميزة غير متوفرة لغرفتك 😭",
    issueReport: {
        menuAction: "الإبلاغ عن مشكلة",
        formTitle: "الإبلاغ عن مشكلة",
        emailLabel: "البريد الإلكتروني (غير مطلوب)",
        nameLabel: "الاسم (غير مطلوب)",
        descriptionLabel: "الوصف* (مطلوب)",
        descriptionPlaceholder: "ما هي المشكلة؟ ما الذي كنت تتوقع؟",
        submitButtonLabel: "الإبلاغ عن مشكلة",
        cancelButtonLabel: "إلغاء",
        confirmButtonLabel: "تأكيد",
        addScreenshotButtonLabel: "إضافة لقطة الشاشة",
        removeScreenshotButtonLabel: "إزالة لقطة الشاشة",
        successMessageText: "شكرا لك على الإبلاغ! سنقوم بمراجعته في أقرب وقت ممكن.",
        highlightToolText: "تمييز",
        hideToolText: "إخفاء",
        removeHighlightText: "إزالة",
    },
    personalDesk: {
        label: "الذهاب إلى مكتبي",
        unclaim: "تحرير مكتبي",
        errorNoUser: "تعذر العثور على معلومات المستخدم",
        errorNotFound: "ليس لديك مكتب شخصي بعد",
        errorMoving: "تعذر الوصول إلى مكتبك الشخصي",
        errorUnclaiming: "تعذر تحرير مكتبك الشخصي",
    },
};

export default actionbar;
