import type { DeepPartial } from "../DeepPartial";
import type { Translation } from "../i18n-types";

const megaphone: DeepPartial<Translation["megaphone"]> = {
    modal: {
        backToSelectCommunication: "กลับไปเลือกวิธีการสื่อสาร",
        selectCommunication: "เลือกวิธีการสื่อสาร",
        title: "การสื่อสารแบบทั่วถึง",
        selectCamera: "เลือกกล้อง 📹",
        selectMicrophone: "เลือกไมโครโฟน 🎙️",
        liveMessage: {
            startMegaphone: "เริ่มใช้เมกะโฟน",
            stopMegaphone: "หยุดใช้เมกะโฟน",
            goingToStream: "คุณกำลังจะถ่ายทอด",
            yourMicrophone: "ไมโครโฟนของคุณ",
            yourCamera: "กล้องของคุณ",
            yourScreen: "หน้าจอของคุณ",
            title: "เมกะโฟน",
            button: "เริ่มข้อความสด",
            and: "และ",
            toAll: "ถึงผู้เข้าร่วมทุกคน",
            confirm: "ยืนยัน",
            cancel: "ยกเลิก",
            notice: `
            ข้อความสดหรือ "เมกะโฟน" ช่วยให้คุณส่งข้อความสดพร้อมกล้องและไมโครโฟนของคุณไปยังทุกคนที่เชื่อมต่ออยู่ในห้องหรือในโลกนี้

            ข้อความนี้จะแสดงที่มุมล่างของหน้าจอ เหมือนกับวิดีโอคอลหรือบับเบิลสนทนา

            ตัวอย่างการใช้ข้อความสด: "สวัสดีทุกคน เริ่มการประชุมกันเลยไหม? 🎉 ตามอวาตาร์ของฉันไปยังพื้นที่ประชุมแล้วเปิดแอปวิดีโอได้เลย 🚀"
            `,
            settings: "การตั้งค่า",
        },
        textMessage: {
            title: "ข้อความตัวอักษร",
            notice: `
            ข้อความตัวอักษรช่วยให้คุณส่งข้อความไปยังทุกคนที่เชื่อมต่ออยู่ในห้องหรือในโลกนี้

            ข้อความนี้จะแสดงเป็นป็อปอัปที่ด้านบนของหน้า พร้อมเสียงแจ้งเตือนเพื่อบอกว่ามีข้อมูลให้อ่าน

            ตัวอย่างข้อความ: "การประชุมในห้อง 3 จะเริ่มในอีก 2 นาที 🎉 คุณสามารถไปยังพื้นที่ประชุม 3 แล้วเปิดแอปวิดีโอได้เลย 🚀"
            `,
            button: "ส่งข้อความตัวอักษร",
            noAccess: "คุณไม่มีสิทธิ์ใช้ฟีเจอร์นี้ 😱 กรุณาติดต่อผู้ดูแลระบบ 🙏",
        },
        audioMessage: {
            title: "ข้อความเสียง",
            notice: `
            ข้อความเสียงคือไฟล์ประเภท "MP3, OGG..." ที่ส่งถึงผู้ใช้ทุกคนที่เชื่อมต่ออยู่ในห้องหรือในโลกนี้

            ข้อความเสียงนี้จะถูกดาวน์โหลดและเล่นให้ทุกคนที่ได้รับการแจ้งเตือนนี้ฟัง

            ตัวอย่างเช่น ข้อความเสียงอาจเป็นการบันทึกเสียงแจ้งว่าการประชุมจะเริ่มในอีกไม่กี่นาที
            `,
            button: "ส่งข้อความเสียง",
            noAccess: "คุณไม่มีสิทธิ์ใช้ฟีเจอร์นี้ 😱 กรุณาติดต่อผู้ดูแลระบบ 🙏",
        },
    },
};

export default megaphone;
